//Задание 2. Вариант 15. Выполнил - Назаров Павел. РИС-26-3б

#include <iostream> //Подключаем библиотеку для управлением ввода/вывода
using namespace std; //используем пространство имён std
#include <clocale> //Подключаем библиотеку для локализации

int main(){
    setlocale(LC_ALL, ".65001"); //подключаем русскую локализацию
    int n,m; //объявляем переменные
    cout << "Введите чила m и n: "; //выводим текст
    cin >> n >> m; //вводим числа

    cout << endl << "1) " << (n++ - m) << endl; 
    //после выполнения n увеличивается на 1
    //т.е. выражение на этом этапе n-m, потом n=n+1
    //результат выведится таким: n-m

    cout << "2) " << (m-- > n) << endl;
    //после выполнения m уменьшится на 1,
    //т.е. выражение на этом этапе m-(n+1), потом m=m-1
    //вывод либо 1, либо 0, так как используется логический оператор

    cout << "3) " << (n-- > m) << endl; 
    //после выполнения n уменьшится на 1,
    //т.е. выражение на этом этапе (n+1)-(m-1), потом n=(n+1)-1=n
    //вывод либо 1, либо 0, так как используется логический оператор

    return 0; //возвращается 0, как индефикатор правильного выполнения программы
}
/* Вывод: в результате переменная n останется такой же (n+1-1), m уменьшится на 1 (m-1)
Вывод: постфискный унарный оперетор преобразует число после применения значения переменной,
а префиксный унарый оператор сначала меняет значение переменной в большую или меньшую сторонцу
и применяет её */