//Задание 1. Вариант 15. Выполнил - Назаров Павел. РИС-26-3б

#include <iostream> //Подключаем библиотеку для управлением ввода/вывода
using namespace std; //используем пространство имён std

//расчёт формулы для float
float Ff (float a, float b)
{
    float sum = a + b; // для удобства создаём сумму b и a
    return ( sum*sum*sum - a*a*a ) / ( 3*a*b*b + b*b*b + 3*a*a*b ); //возвращаем результат
}

//расчёт формулы для doble:
double Fd (double a, double b)
{
    double sum = a + b; // для удобства создаём сумму b и a
    return ( sum*sum*sum - a*a*a ) / ( 3*a*b*b + b*b*b + 3*a*a*b ); //возвращаем результат
}

int main()
{
    float af = 1000 , bf = 0.0001; //задаём переменные float
    double ad = 1000 , bd = 0.0001; //задаём те же переменные double
    cout << "Float type result: " << Ff( af , bf ) << endl; //выводим значение формулы для float
    cout << "Double type result: " << Fd( ad , bd ) << endl; //выводим значение формулы для double
    return 0; //возвращается 0, как индефикатор правильного выполнения программы
}
/* Объяснение результатов:
Числа float и double хранятся в двоичном формате.
У них есть фиксированное количество бит для мантиссы (значащих цифр) и показателя степени.
Из-за этого многие десятичные дроби не могут быть представлены точно в двоичном виде.  
Пример:
double d = 0.1; // в компьютере - 0.100000000000000001
float d2 = 0.1; // в компьютере - 0.100000001
по факту число 0.1 - в двоичной СС имеет бесконечную мантиссу,
поэтому точность вычислений определяется длиной записи числа,
в нашем случае float - 4 байта и double - 8 байт
То есть точность разная
*/