#include <iostream> //подключаем библиотеку для управления вводом / выводом
#include <clocale> //подключаем библиотеку для локализации
#include <cmath> //подключаем библиотеку math для функции возведения в степень pow
using namespace std; //подключаем пространство имён std

int main(){
    setlocale(LC_ALL, ".65001"); // подключаем русскую локализацию
    long double s = 0, n = 1, an = 0.25l; const long double ac = 0.0001l; //выделяем память для переменных
    //Параллельно иницаализируем s - сумма, ac - точность, an - энный элемент в нашем случае при n = 1
    //n = 1 вычисляется устно, у переменных в конце стоит l, чтобы явно инициализировать переменную, как long double
    //long double лучше всего подойдёт для решения задачи, чтобы обеспечить высокую точность вычислений

    while(an >= ac) //начинаем цикл while 
    {
        s += an; n++; //изменяем сумму, добавляя элемент, который получен в предыдущей итерации
        an = an * n * n / powl(4.0l, n); //вычисляем новый энный элемент
    }
    cout << "Вариант 15, выполнил Назаров Павел РИС-26-3Б" << endl <<\
     "Сумма равна элементов с 1 по " << n << \
     ", которые удволетворяют заданной точности равна = " << s << endl; //выводим информацию о результате работы программы
    
    return 0; //возвращаем 0, как результат верного выполнения блока main()
}

/* Анализ задачи
1) Преобразуем формулу ( ^ - возведение в степень )
an = (n! ^ 2) / (2 ^ n ^ 2)
an = (n! ^ 2) / (4 ^ n)
2) тогда a(n+1) = an * ( ((n+1)/2) ^2 )
3) понадобится 4 переменных:
s - сумма
ac - точность
n - номер элемента
an - результат вычисления a(n)
4) Начнём цикл while и будем прибавлять к s элементы, пока не привысим точность ac
5) Выводим результат
*/